tests/fixtures/vcr_cassettes/test_envia_documento_ginfes.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      User-Agent:
      - Zeep/3.4.0 (www.python-zeep.org)
    method: GET
    uri: https://homologacao.ginfes.com.br/ServiceGinfesImpl?wsdl
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAAO1bz2+bMBS+96/gxi1u15wiEmndYZrUdVM7VbtNLrgUiWBkO0v73882kCZgfhSb
        GGk+hZDn9/x9frafP0gQoeckS1iCM+plcIvW/gMif5MQfU2yZ0S/bfO0vOF7DJIYsTtuRXMYctMX
        xvIVAC94i1McwxDiRSybLUK8XTwR33vdphk9GNLwBW0hXfC7FMN8gUkM9jRKQWm4Enf7rcW3QxN2
        5L+vI6tXGh2M9/v9Yn8tvX66vLwCv7/fPsiI/ubCC9hbjugmAMUnv8FBUxijNpL+fIFZiFJI7p4p
        uucEcUKR8OQFOSSsbEYQ25GMM8m9rn3emxVlJMlin0cSZiIQKCMNCsqj7FJWRP2JyX1OH6+tRl+e
        P/otZoiHbgTk2Xo5QbiHhO1EhpVhH5cfD1y3vjLYzaM0tDEYdXauZ8XOPQpRHvLF7pA1M+ugYkpN
        nNcKSmaW0bV5Ptfu1TL/XMuRnOiW1nxra/1cZ21j9bO7F8+LpKOd6ZyToyqLZkvGjMdpzqxZmFuN
        0s/eAmgh9BwT4qRv85pHqlrTesqerQOqstLabLEzV85aAVpaD4rN1WIdaDGhz34wM4Y1x4T94rZt
        sYsAOEcECmWwNDsp4Dzul99liPwgESIleNHOC5Is3zGvjLf2WUZXfeVgAGSjoj3esQ86eGcmAEVr
        iQAcIPQC4hubEpInN4WRuMRuqYnsOMNHY1tOgW2pj205Eltd+dNPxoaWOAZa666jA85cYirO0AZQ
        jk7QpqwzEc6RidpRcY/CaWjZPK0wdIBpLJwKldIsskr61MVXr080UZqfjKcKhRm42lPyREOaDrDm
        xFQ/dRoNeJqxNTGqRsZzmpE0MYbao1dX3s0tRQ1NXwdr61HcBGjz2at4kmcQvXZONx/DToxfM9M7
        tMOP4FccQ7XTXXW0HQG168CqB9FYcquf/xrBOjahlc9fJ0M7Lom7xbx2tAGolAbx5SnJoiSL20SH
        m+LnSsVQ9qQQJsT7P6vKG2VvqZBA8pC3JDCjImTnO0Ty9SHxuw/6dY6CJhnx3U58/RyKy7VfOClH
        RF5WHcTRm/Q4+GWpHeVmacJHHaaV2+ZgTRBjtGTi2OkSXRw73bKN46dP+XEM9WlGjqEOtcmR0ytb
        OYoGaF6OpAE6mSOpU1tz9HRqc46eYdqe42moHOiYGiocOqb6JEbHUL9C6Tjq1zX/a44CUGqW4poW
        0mabGFr951J6EYqmV7ZtEUYP4mmLP16lsmP2YRQRRKmX4hAWzPeBBaCpxhb6qRR5Jb4S1OYiAEf/
        K938A3eLz1ZlOgAA
    headers:
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Type:
      - text/xml
      Date:
      - Fri, 20 Nov 2020 18:15:02 GMT
      Server:
      - nginx
      Transfer-Encoding:
      - chunked
      Vary:
      - Accept-Encoding
      X-Powered-By:
      - Servlet 2.5; JBoss-5.0/JBossWeb-2.1
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version=''1.0'' encoding=''utf-8''?>

      <soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Body><ns0:RecepcionarLoteRpsV3
      xmlns:ns0="http://homologacao.ginfes.com.br"><arg0>&lt;ns2:cabecalho xmlns:ns2="http://www.ginfes.com.br/cabecalho_v03.xsd"
      versao="3"&gt;&lt;versaoDados&gt;3&lt;/versaoDados&gt;&lt;/ns2:cabecalho&gt;</arg0><arg1>&lt;EnviarLoteRpsEnvio
      xmlns="http://www.ginfes.com.br/servico_enviar_lote_rps_envio_v03.xsd" xmlns:tipos="http://www.ginfes.com.br/tipos_v03.xsd"&gt;&lt;LoteRps
      Id="lote20201120151502"&gt;&lt;tipos:NumeroLote&gt;20201120151502&lt;/tipos:NumeroLote&gt;&lt;tipos:Cnpj&gt;23130935000198&lt;/tipos:Cnpj&gt;&lt;tipos:InscricaoMunicipal&gt;35172&lt;/tipos:InscricaoMunicipal&gt;&lt;tipos:QuantidadeRps&gt;1&lt;/tipos:QuantidadeRps&gt;&lt;ListaRps
      xmlns="http://www.ginfes.com.br/tipos_v03.xsd"&gt;&lt;Rps&gt;&lt;InfRps Id="rps334"&gt;&lt;IdentificacaoRps&gt;&lt;Numero&gt;334&lt;/Numero&gt;&lt;Serie&gt;111&lt;/Serie&gt;&lt;Tipo&gt;1&lt;/Tipo&gt;&lt;/IdentificacaoRps&gt;&lt;DataEmissao&gt;2020-11-20T12:00:21&lt;/DataEmissao&gt;&lt;NaturezaOperacao&gt;1&lt;/NaturezaOperacao&gt;&lt;RegimeEspecialTributacao&gt;1&lt;/RegimeEspecialTributacao&gt;&lt;OptanteSimplesNacional&gt;1&lt;/OptanteSimplesNacional&gt;&lt;IncentivadorCultural&gt;2&lt;/IncentivadorCultural&gt;&lt;Status&gt;1&lt;/Status&gt;&lt;Servico&gt;&lt;Valores&gt;&lt;ValorServicos&gt;100&lt;/ValorServicos&gt;&lt;ValorDeducoes&gt;0&lt;/ValorDeducoes&gt;&lt;ValorPis&gt;0&lt;/ValorPis&gt;&lt;ValorCofins&gt;0&lt;/ValorCofins&gt;&lt;ValorInss&gt;0&lt;/ValorInss&gt;&lt;ValorIr&gt;0&lt;/ValorIr&gt;&lt;ValorCsll&gt;0&lt;/ValorCsll&gt;&lt;IssRetido&gt;2&lt;/IssRetido&gt;&lt;ValorIss&gt;2&lt;/ValorIss&gt;&lt;ValorIssRetido&gt;0&lt;/ValorIssRetido&gt;&lt;OutrasRetencoes&gt;0&lt;/OutrasRetencoes&gt;&lt;BaseCalculo&gt;100&lt;/BaseCalculo&gt;&lt;Aliquota&gt;0.02&lt;/Aliquota&gt;&lt;ValorLiquidoNfse&gt;100&lt;/ValorLiquidoNfse&gt;&lt;/Valores&gt;&lt;ItemListaServico&gt;105&lt;/ItemListaServico&gt;&lt;CodigoCnae&gt;1830003&lt;/CodigoCnae&gt;&lt;CodigoTributacaoMunicipio&gt;6202300&lt;/CodigoTributacaoMunicipio&gt;&lt;Discriminacao&gt;[ODOO_DEV]
      Customized Odoo Development&lt;/Discriminacao&gt;&lt;CodigoMunicipio&gt;3132404&lt;/CodigoMunicipio&gt;&lt;/Servico&gt;&lt;Prestador&gt;&lt;tipos:Cnpj&gt;23130935000198&lt;/tipos:Cnpj&gt;&lt;tipos:InscricaoMunicipal&gt;35172&lt;/tipos:InscricaoMunicipal&gt;&lt;/Prestador&gt;&lt;Tomador&gt;&lt;IdentificacaoTomador&gt;&lt;CpfCnpj&gt;&lt;Cnpj&gt;62228384000151&lt;/Cnpj&gt;&lt;/CpfCnpj&gt;&lt;/IdentificacaoTomador&gt;&lt;RazaoSocial&gt;AMD
      South America Ltda&lt;/RazaoSocial&gt;&lt;Endereco&gt;&lt;Endereco&gt;Rua Samuel
      Morse&lt;/Endereco&gt;&lt;Numero&gt;134&lt;/Numero&gt;&lt;Bairro&gt;Brooklin&lt;/Bairro&gt;&lt;CodigoMunicipio&gt;3550308&lt;/CodigoMunicipio&gt;&lt;Uf&gt;SP&lt;/Uf&gt;&lt;Cep&gt;4576060&lt;/Cep&gt;&lt;/Endereco&gt;&lt;/Tomador&gt;&lt;/InfRps&gt;&lt;Signature
      xmlns="http://www.w3.org/2000/09/xmldsig#"&gt;&lt;SignedInfo&gt;&lt;CanonicalizationMethod
      Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/&gt;&lt;SignatureMethod
      Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/&gt;&lt;Reference URI="#rps334"&gt;&lt;Transforms&gt;&lt;Transform
      Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/&gt;&lt;Transform
      Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/&gt;&lt;/Transforms&gt;&lt;DigestMethod
      Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/&gt;&lt;DigestValue&gt;f44Gm+xy45CQBB8K7mgCl9QxiOA=&lt;/DigestValue&gt;&lt;/Reference&gt;&lt;/SignedInfo&gt;&lt;SignatureValue&gt;vfKIvi88pLmC7TBmP139jLHojQxbFNet/AnxuFL5c/JSn15XwLwCd9INrIRZlBwzjh0XtsA8xXboe4SvMHXbf+lEbaYNNUWLOPzh3nqxydzWxdaXFPkVtGTdexoVHIoZzkFcJh1dR5sXKupXQQkbjXCP5Xl22RrUoUZV/7D26kQpZ+BwhgKeR1LwY/k6FUvo8L8x4hpmZfPRBWneKJNx1C0QZJn0Rbd3hxBfPn5UoJAw1mu3gDVgaQciTlYUSo4gkV3XmOvPuzfYRphVmwwpGWYxXdpN1tK0n6RXNyEacjyV0mbjceDBigkSat4Z9Gfc2AP/VIliPUbPgiS0oSGtAw==&lt;/SignatureValue&gt;&lt;KeyInfo&gt;&lt;X509Data&gt;&lt;X509Certificate&gt;MIIH4zCCBcugAwIBAgIIHwSZMUkzNT4wDQYJKoZIhvcNAQELBQAwdDELMAkGA1UE

      BhMCQlIxEzARBgNVBAoTCklDUC1CcmFzaWwxNjA0BgNVBAsTLVNlY3JldGFyaWEg

      ZGEgUmVjZWl0YSBGZWRlcmFsIGRvIEJyYXNpbCAtIFJGQjEYMBYGA1UEAxMPQUMg

      VkFMSUQgUkZCIHY1MB4XDTE5MTIwNDE1MTcwMFoXDTIwMTIwMzE1MTcwMFowggEF

      MQswCQYDVQQGEwJCUjELMAkGA1UECBMCTUcxEDAOBgNVBAcTB0lUQUpVQkExEzAR

      BgNVBAoTCklDUC1CcmFzaWwxNjA0BgNVBAsTLVNlY3JldGFyaWEgZGEgUmVjZWl0

      YSBGZWRlcmFsIGRvIEJyYXNpbCAtIFJGQjEWMBQGA1UECxMNUkZCIGUtQ05QSiBB

      MTEqMCgGA1UECxMhQVIgVkFMRUNFUlQgQ0VSVElGSUNBRE9SQSBESUdJVEFMMRcw

      FQYDVQQLEw4yNDA2Mjc5MjAwMDE5NzEtMCsGA1UEAxMkS01FRSBJTkZPUk1BVElD

      QSBMVERBOjIzMTMwOTM1MDAwMTk4MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB

      CgKCAQEAzyhZGUXxAQ0qXkrcnpKczV05KFxty6kH+oCdRdXrzuwSh2CWyC0bj1eD

      KFd0NzPGivYZha2/zIQQg0Pw6b5kurBtVVzh44g82+cWyEDLwD439c610ajlSCFM

      V4+0IQ4QiTEUSBX5rCMYGhdwzlOe7QJyqXdQ1FZushxi9weCauHkBnSoB7Ra+GyT

      tCHNx48IW9WXONq2zVHOvbcqxU4V7zXTD1jmA3fvwpisIDjmypA7xli8SNh9GH/f

      XB/2ksbSw025kE8sQqBrvdcM2dBagC4WRF9BcyaHEpVm1X0Drmcle6Zta+gkraLu

      aeh/QKZkENkC0D2gDipQ2hzkOs/9yQIDAQABo4IC5DCCAuAwgZwGCCsGAQUFBwEB

      BIGPMIGMMFUGCCsGAQUFBzAChklodHRwOi8vaWNwLWJyYXNpbC52YWxpZGNlcnRp

      ZmljYWRvcmEuY29tLmJyL2FjLXZhbGlkcmZiL2FjLXZhbGlkcmZidjUucDdiMDMG

      CCsGAQUFBzABhidodHRwOi8vb2NzcHY1LnZhbGlkY2VydGlmaWNhZG9yYS5jb20u

      YnIwCQYDVR0TBAIwADAfBgNVHSMEGDAWgBRTy6XkdVCZQCy+WxVFyb7LMKqJxTBw

      BgNVHSAEaTBnMGUGBmBMAQIBJTBbMFkGCCsGAQUFBwIBFk1odHRwOi8vaWNwLWJy

      YXNpbC52YWxpZGNlcnRpZmljYWRvcmEuY29tLmJyL2FjLXZhbGlkcmZiL2RwYy1h

      Yy12YWxpZHJmYnY1LnBkZjCBtgYDVR0fBIGuMIGrMFOgUaBPhk1odHRwOi8vaWNw

      LWJyYXNpbC52YWxpZGNlcnRpZmljYWRvcmEuY29tLmJyL2FjLXZhbGlkcmZiL2xj

      ci1hYy12YWxpZHJmYnY1LmNybDBUoFKgUIZOaHR0cDovL2ljcC1icmFzaWwyLnZh

      bGlkY2VydGlmaWNhZG9yYS5jb20uYnIvYWMtdmFsaWRyZmIvbGNyLWFjLXZhbGlk

      cmZidjUuY3JsMA4GA1UdDwEB/wQEAwIF4DAdBgNVHSUEFjAUBggrBgEFBQcDAgYI

      KwYBBQUHAwQwgbgGA1UdEQSBsDCBrYETYW5hbmlhc0BrbWVlLmNvbS5icqA4BgVg

      TAEDBKAvBC0xMTA0MTk4MDAwNzcxNjM2NDgyMDAwMDAwMDAwMDAwMDAwMDAwMDAw

      MDAwMDCgKAYFYEwBAwKgHwQdQU5BTklBUyBQRVJFSVJBIEJBVElTVEEgRklMSE+g

      GQYFYEwBAwOgEAQOMjMxMzA5MzUwMDAxOTigFwYFYEwBAwegDgQMMDAwMDAwMDAw

      MDAwMA0GCSqGSIb3DQEBCwUAA4ICAQBDae6+hrTCn/xEHTZsbsEfQIFmj7t1Tcl3

      YnF2r2rmZaXJpiCxDzRCnqaaPdcfmFCkvdvt8YhmhK7ik+ma861VQ2orv8lrzY8P

      q8juNAwJ08FI6+LEYvAUvzJj5WzQqahIQd1KzzcVjYgcieNpdnejCZsECu5RP9Tr

      knPLegaC5J8YX2fKuNxev4t4SSJPMoYgkUNPaENXRzswS1vz5X8vX/g00a/efbJ8

      9z/vC7e3WttYwpojIaoe8MKa7twN1eMOe7xbwFmM3nqhO/i59UmW0OlArsMrqLdJ

      YD507Aih00zfeLJT0ML+AfKuMg926wpOkqcgSaKrn7TtvobYPSydMxUyiHwg+4Yi

      jIYT/rmZL3X/ntFmkhR19+28237BbLBNROxNNtn4oBvfZ4tApLzuJUFtajAa9sRO

      CizmOYFiESKAXYj/P+5heb0dDTz87izXmj0TrDLrJxIqU4CIPTFTHj5DHI4/U7zn

      6Ux6IypM3CxzxQ5WXj7OepU0gJUutIJ0Zd2X41+JxVw05JXUM3JbucHHGxxN2DMU

      Z+ruvJC48iqs9ZgwpGQUIV6ksSmYtaa5isLDbB4EeCBo2pOgq7nafIVw/K7to3+H

      Z5DuZifc1bc3xuqUbu/R08yPZhNQwjN5CKFQztQ+rfNm+lZugo5/7O3oAc1PqMAc

      1c8J4lLBZw==

      &lt;/X509Certificate&gt;&lt;/X509Data&gt;&lt;/KeyInfo&gt;&lt;/Signature&gt;&lt;/Rps&gt;&lt;/ListaRps&gt;&lt;/LoteRps&gt;&lt;/EnviarLoteRpsEnvio&gt;</arg1></ns0:RecepcionarLoteRpsV3></soap-env:Body></soap-env:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '6996'
      Content-Type:
      - text/xml; charset=utf-8
      SOAPAction:
      - '""'
      User-Agent:
      - Zeep/3.4.0 (www.python-zeep.org)
    method: POST
    uri: https://homologacao.ginfes.com.br//ServiceGinfesImpl
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAAIVSUWvCMBD+Kz7pk03SKrpaK4xt7GGMIdteS0xvtdDmuiRW/fdLNC3KBCGBy933
        ffeRuwRkGz/LFipsYHCoK6ljm1qOtsY0MSFabKHmOrAVjbwJUBXEBQQ8h4zSxGm8As9BpQm5fLj4
        EfNjmkhN4zUIaESJkqs3NLBu9He0Bt2g1F1rC+tbb7HGCgsuOAZFKX9ABwLrYKNsRwVmp2Q6rMxi
        ZZmDFpS2wsvh7w7NggX0HAxACsxLWfjC1+fLeO5L2nCZ8wol+OIR9DlYDQuzcNJSR+5vyt7vya0l
        9m5Dz/WW9/v9tVViSkvIWhoFB537zh05ukfWoNpSYAYnD1llTWSq0ZnyNq51L12/72pQ6Fy7bEhD
        ypi9UzalocOQ/6CO+sQNd5PalDVIgx1/zNg4pJ9sGttDJ73IDXin9KHQoLAzdElGZ/OH+WTWE6+q
        ffbmdztEQvzME3Jvl/wSnhePXC54+geqvOfZ7wIAAA==
    headers:
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Type:
      - text/xml;charset=UTF-8
      Date:
      - Fri, 20 Nov 2020 18:15:04 GMT
      Server:
      - nginx
      Transfer-Encoding:
      - chunked
      Vary:
      - Accept-Encoding
      X-Powered-By:
      - Servlet 2.5; JBoss-5.0/JBossWeb-2.1
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version=''1.0'' encoding=''utf-8''?>

      <soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Body><ns0:ConsultarSituacaoLoteRpsV3
      xmlns:ns0="http://homologacao.ginfes.com.br"><arg0>&lt;ns2:cabecalho xmlns:ns2="http://www.ginfes.com.br/cabecalho_v03.xsd"
      versao="3"&gt;&lt;versaoDados&gt;3&lt;/versaoDados&gt;&lt;/ns2:cabecalho&gt;</arg0><arg1>&lt;ConsultarSituacaoLoteRpsEnvio
      xmlns="http://www.ginfes.com.br/servico_consultar_situacao_lote_rps_envio_v03.xsd"
      xmlns:tipos="http://www.ginfes.com.br/tipos_v03.xsd"&gt;&lt;Prestador&gt;&lt;tipos:Cnpj&gt;23130935000198&lt;/tipos:Cnpj&gt;&lt;tipos:InscricaoMunicipal&gt;35172&lt;/tipos:InscricaoMunicipal&gt;&lt;/Prestador&gt;&lt;Protocolo&gt;10789847&lt;/Protocolo&gt;&lt;Signature
      xmlns="http://www.w3.org/2000/09/xmldsig#"&gt;&lt;SignedInfo&gt;&lt;CanonicalizationMethod
      Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/&gt;&lt;SignatureMethod
      Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/&gt;&lt;Reference URI=""&gt;&lt;Transforms&gt;&lt;Transform
      Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/&gt;&lt;Transform
      Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/&gt;&lt;/Transforms&gt;&lt;DigestMethod
      Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/&gt;&lt;DigestValue&gt;5NMCw6b40ZyxT1sDJ/2nr/Mk1vg=&lt;/DigestValue&gt;&lt;/Reference&gt;&lt;/SignedInfo&gt;&lt;SignatureValue&gt;js1LwBc5a3vjWMDwsYEQaJcglkCGukZNfkVMlgtMqLNf1fn9gDLA7cMp0DBnBJGxZDdV6CUABOJMHvbRedvADRPiIyF2FBAEXMf50S4SZGyjw59HJzuC5GREHDeBeiExkaT0ov4+uVU2sXVqVWzANEC7PPteh4SkEb6p1Q+mGk+WVWwikBYkXKHO2GB2Hldwp2LeXnzLmYqGmqEim3ldjoKtj53cSxZ2p5ie90X2+HoG6bXKIKzM7qVq9JGkIkqg+55FQE2l0Igrd7y68MIExGbjSTrg7QvC/4OqKtVdEUXRI3Nt+66+Sr4HgkGEFjJertQQ1BDMAj6Am3jdTo3QMw==&lt;/SignatureValue&gt;&lt;KeyInfo&gt;&lt;X509Data&gt;&lt;X509Certificate&gt;MIIH4zCCBcugAwIBAgIIHwSZMUkzNT4wDQYJKoZIhvcNAQELBQAwdDELMAkGA1UE

      BhMCQlIxEzARBgNVBAoTCklDUC1CcmFzaWwxNjA0BgNVBAsTLVNlY3JldGFyaWEg

      ZGEgUmVjZWl0YSBGZWRlcmFsIGRvIEJyYXNpbCAtIFJGQjEYMBYGA1UEAxMPQUMg

      VkFMSUQgUkZCIHY1MB4XDTE5MTIwNDE1MTcwMFoXDTIwMTIwMzE1MTcwMFowggEF

      MQswCQYDVQQGEwJCUjELMAkGA1UECBMCTUcxEDAOBgNVBAcTB0lUQUpVQkExEzAR

      BgNVBAoTCklDUC1CcmFzaWwxNjA0BgNVBAsTLVNlY3JldGFyaWEgZGEgUmVjZWl0

      YSBGZWRlcmFsIGRvIEJyYXNpbCAtIFJGQjEWMBQGA1UECxMNUkZCIGUtQ05QSiBB

      MTEqMCgGA1UECxMhQVIgVkFMRUNFUlQgQ0VSVElGSUNBRE9SQSBESUdJVEFMMRcw

      FQYDVQQLEw4yNDA2Mjc5MjAwMDE5NzEtMCsGA1UEAxMkS01FRSBJTkZPUk1BVElD

      QSBMVERBOjIzMTMwOTM1MDAwMTk4MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB

      CgKCAQEAzyhZGUXxAQ0qXkrcnpKczV05KFxty6kH+oCdRdXrzuwSh2CWyC0bj1eD

      KFd0NzPGivYZha2/zIQQg0Pw6b5kurBtVVzh44g82+cWyEDLwD439c610ajlSCFM

      V4+0IQ4QiTEUSBX5rCMYGhdwzlOe7QJyqXdQ1FZushxi9weCauHkBnSoB7Ra+GyT

      tCHNx48IW9WXONq2zVHOvbcqxU4V7zXTD1jmA3fvwpisIDjmypA7xli8SNh9GH/f

      XB/2ksbSw025kE8sQqBrvdcM2dBagC4WRF9BcyaHEpVm1X0Drmcle6Zta+gkraLu

      aeh/QKZkENkC0D2gDipQ2hzkOs/9yQIDAQABo4IC5DCCAuAwgZwGCCsGAQUFBwEB

      BIGPMIGMMFUGCCsGAQUFBzAChklodHRwOi8vaWNwLWJyYXNpbC52YWxpZGNlcnRp

      ZmljYWRvcmEuY29tLmJyL2FjLXZhbGlkcmZiL2FjLXZhbGlkcmZidjUucDdiMDMG

      CCsGAQUFBzABhidodHRwOi8vb2NzcHY1LnZhbGlkY2VydGlmaWNhZG9yYS5jb20u

      YnIwCQYDVR0TBAIwADAfBgNVHSMEGDAWgBRTy6XkdVCZQCy+WxVFyb7LMKqJxTBw

      BgNVHSAEaTBnMGUGBmBMAQIBJTBbMFkGCCsGAQUFBwIBFk1odHRwOi8vaWNwLWJy

      YXNpbC52YWxpZGNlcnRpZmljYWRvcmEuY29tLmJyL2FjLXZhbGlkcmZiL2RwYy1h

      Yy12YWxpZHJmYnY1LnBkZjCBtgYDVR0fBIGuMIGrMFOgUaBPhk1odHRwOi8vaWNw

      LWJyYXNpbC52YWxpZGNlcnRpZmljYWRvcmEuY29tLmJyL2FjLXZhbGlkcmZiL2xj

      ci1hYy12YWxpZHJmYnY1LmNybDBUoFKgUIZOaHR0cDovL2ljcC1icmFzaWwyLnZh

      bGlkY2VydGlmaWNhZG9yYS5jb20uYnIvYWMtdmFsaWRyZmIvbGNyLWFjLXZhbGlk

      cmZidjUuY3JsMA4GA1UdDwEB/wQEAwIF4DAdBgNVHSUEFjAUBggrBgEFBQcDAgYI

      KwYBBQUHAwQwgbgGA1UdEQSBsDCBrYETYW5hbmlhc0BrbWVlLmNvbS5icqA4BgVg

      TAEDBKAvBC0xMTA0MTk4MDAwNzcxNjM2NDgyMDAwMDAwMDAwMDAwMDAwMDAwMDAw

      MDAwMDCgKAYFYEwBAwKgHwQdQU5BTklBUyBQRVJFSVJBIEJBVElTVEEgRklMSE+g

      GQYFYEwBAwOgEAQOMjMxMzA5MzUwMDAxOTigFwYFYEwBAwegDgQMMDAwMDAwMDAw

      MDAwMA0GCSqGSIb3DQEBCwUAA4ICAQBDae6+hrTCn/xEHTZsbsEfQIFmj7t1Tcl3

      YnF2r2rmZaXJpiCxDzRCnqaaPdcfmFCkvdvt8YhmhK7ik+ma861VQ2orv8lrzY8P

      q8juNAwJ08FI6+LEYvAUvzJj5WzQqahIQd1KzzcVjYgcieNpdnejCZsECu5RP9Tr

      knPLegaC5J8YX2fKuNxev4t4SSJPMoYgkUNPaENXRzswS1vz5X8vX/g00a/efbJ8

      9z/vC7e3WttYwpojIaoe8MKa7twN1eMOe7xbwFmM3nqhO/i59UmW0OlArsMrqLdJ

      YD507Aih00zfeLJT0ML+AfKuMg926wpOkqcgSaKrn7TtvobYPSydMxUyiHwg+4Yi

      jIYT/rmZL3X/ntFmkhR19+28237BbLBNROxNNtn4oBvfZ4tApLzuJUFtajAa9sRO

      CizmOYFiESKAXYj/P+5heb0dDTz87izXmj0TrDLrJxIqU4CIPTFTHj5DHI4/U7zn

      6Ux6IypM3CxzxQ5WXj7OepU0gJUutIJ0Zd2X41+JxVw05JXUM3JbucHHGxxN2DMU

      Z+ruvJC48iqs9ZgwpGQUIV6ksSmYtaa5isLDbB4EeCBo2pOgq7nafIVw/K7to3+H

      Z5DuZifc1bc3xuqUbu/R08yPZhNQwjN5CKFQztQ+rfNm+lZugo5/7O3oAc1PqMAc

      1c8J4lLBZw==

      &lt;/X509Certificate&gt;&lt;/X509Data&gt;&lt;/KeyInfo&gt;&lt;/Signature&gt;&lt;/ConsultarSituacaoLoteRpsEnvio&gt;</arg1></ns0:ConsultarSituacaoLoteRpsV3></soap-env:Body></soap-env:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '4771'
      Content-Type:
      - text/xml; charset=utf-8
      SOAPAction:
      - '""'
      User-Agent:
      - Zeep/3.4.0 (www.python-zeep.org)
    method: POST
    uri: https://homologacao.ginfes.com.br//ServiceGinfesImpl
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAAI2STWvDMAyG/0pP7Wl2PiiMNE1hY2OHsUP3cQ1eoqUBx8osJ23//ezWCSljdIeA
        Ir2v/MhWCqpPHlQPEluYHRqpKLGp9WJnTJtwTsUOGkHMVghFy1BX3AUcvIcvstT1eAJRgs5SPv1x
        8R2WxyxVFCT3qKiTRujX2nSiEPiMBrYtfcRboNYWBwArHgF22KDEyslZVasvIFZgwz61PVeD6bTK
        5tKsNtY560FTjWo9/+7QrEIWnIMZqALLWlW+8P72eHPrS2SEKoVEBb54BDoHm3llVq61ovhP9BO4
        7TGCR76Np9/v95fU3NTWkPdBzA5UeojBHF8zE+i+LjAvBpycPE8uLVCuW8q1R7o8YzrMS9eAPk3g
        slEQBWFov2W4DCKn4b9Fg3UY/2QctdPsmLx2ZU6ccv+EKf/fgvj9Ou8Un+5u9gM5ed1sygIAAA==
    headers:
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Type:
      - text/xml;charset=UTF-8
      Date:
      - Fri, 20 Nov 2020 18:15:05 GMT
      Server:
      - nginx
      Transfer-Encoding:
      - chunked
      Vary:
      - Accept-Encoding
      X-Powered-By:
      - Servlet 2.5; JBoss-5.0/JBossWeb-2.1
    status:
      code: 200
      message: OK
version: 1
